Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиШтатногоРасписания/НастройкиШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиШтатногоРасписания</name>
  <resources>
    <name>ИспользоватьВилкуСтавокВШтатномРасписании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьИндексациюШтатногоРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьИсториюИзмененияШтатногоРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьШтатноеРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВилкуСтавокВШтатномРасписании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьИсториюИзмененияШтатногоРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьШтатноеРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьНаСоответствиеШтатномуРасписаниюАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеТарифовИНадбавок</name>
    <type>
      <types>EnumRef.ПредставлениеТарифовИНадбавок</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользоватьСтатьиФинансированияВКадровомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБронированиеПозиций</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДнейСохраненияБрони</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/CommonModules/УправлениеШтатнымРасписаниемСобытия/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема «Учет штатного расписания».
//
// Методы, обслуживающие подписки на события.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет настройки учета среднего заработка в зависимости 
//  от количества в информационной базе специализированных начислений.
//
Процедура УстановитьИспользованиеИндексацииШтатногоРасписания(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Или Источник.Количество() = 0  Тогда
		Возврат;
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьИндексациюШтатногоРасписания") <> 
		Источник[0].ИспользоватьИндексациюЗаработка И ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда
		НаборНастройкиШтатногоРасписания = РегистрыСведений.НастройкиШтатногоРасписания.СоздатьНаборЗаписей();
		НаборНастройкиШтатногоРасписания.Прочитать();
		НаборНастройкиШтатногоРасписания[0].ИспользоватьИндексациюШтатногоРасписания = Источник[0].ИспользоватьИндексациюЗаработка И ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания");
		НаборНастройкиШтатногоРасписания.ОбменДанными.Загрузка = Истина;
		НаборНастройкиШтатногоРасписания.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
